Repository: jorgefdezsa/RepositoryPlatformV2
Catalog: DEMO.API.Resources/Messages.*.resx
Languages: es_es, pt_pt

# BATCH_MESSAGE_EMPTY
source: Batch message for JobNumber {0} is empty
es_es: Mensaje Batch para el JobNumber {0} está vacío
pt_pt: A mensagem em lote para JobNumber {0} está vazia

# DOMAIN_INCORECT_VALUES
source: Field: {0} contains incorrect values. Incorrect Value: {1}
es_es: Campo: {0} contiene valores incorrectos. Valor incorrecto: {1}
pt_pt: Campo: {0} contém valores incorretos. Valor incorreto: {1}

# EMPTY_MESSAGE
source: Empty message for {0}
es_es: Mensaje vacío para {0}
pt_pt: Mensagem vazia para {0}

# EXPORT_TIME_ENTRY_PLANNER_NOT_APPROVED
source: The timeentry with id {0} can not send to Planner because is not approved
es_es: El timeentry con id {0} no se puede enviar a Planner porque no está aprobados
pt_pt: O registro de horário com id {0} não pode ser enviado ao Planner porque não foi aprovado

# EXPORT_TIME_ENTRY_PLANNER_NOT_ECONOMIC_FIELDS
source: The timeentry with id {0} can not send to Planner because is does not all contain economic fields
es_es: El timeentry con id {0} no se puede enviar a Planner porque no contiene todos los campos económicos
pt_pt: O registro de horário com id {0} não pode ser enviado ao Planner porque não contém todos os campos econômicos

# FIELD_MANDATORY
source: Field: {0} is mandatory
es_es: Campo: {0} es obligatorio
pt_pt: Campo: {0} é obrigatório

# GUARD_EXISTS_TIMEENTRIES
source: Exists time entries overlap in the guard period. If you continue, this timeentries will set with the guard check are you sure?
es_es: Existen entradas de tiempo de este recurso que se solapan con esta guardia. Si continua, esas entradas de tiempo se marcaran como realizadas en guardia ¿está seguro?
pt_pt: Existem entradas de tempo para este recurso que se sobrepõem a este guarda. Se você continuar, essas entradas de tempo serão marcadas como feitas em guarda, tem certeza?

# GUARD_OVERLAP
source: You can't save the record bacause the dates overlap with other existing by the same resource. Please, review existing records.
es_es: No puede guardar el registro porque las fechas se superponen con otras existentes para el mismo recurso. Por favor, revise los registros existentes.
pt_pt: Você não pode salvar o registro porque as datas se sobrepõem a outras existentes pelo mesmo recurso. Por favor, revise os registros existentes.

# GUARD_RANGE_INCORRECT
source: The guard end date cannot be earlier than the start date
es_es: La fecha final de la guardia no puede ser anterior a la de inicio
pt_pt: A data final não pode ser anterior à data inicial

# GUARD_REMOVE_TIMEENTRIES
source: The check "Guard" will remove in existint time entries, are you sure?
es_es: Si continua, a algunas entradas de tiempo del recurso dejarán de estar marcadas como guardia. ¿Esta seguro?
pt_pt: Se você continuar, em algum momento as entradas do recurso não serão mais marcadas como guarda. Está seguro?

# INCORRECT_VALUES
source: Field: {0} contains incorrect values
es_es: Campo: {0} contiene valores incorrectos
pt_pt: Campo: {0} contém valores incorretos

# MAXIMUN_STRING_LENGTH
source: Field: {0} length is greather than {1}
es_es: Campo: {0} de longitud mayor a {1}
pt_pt: Campo: {0} é maior que {1}

# MESSAGE_SERVICEBUS_BATCH_ERROR
source: Error to send batch messages to Azure Service Bus. Topic {0}. Message {1}
es_es: Error al enviar mensajes Batch a Azure Service Bus. Topic {0}. Mensaje {1}
pt_pt: Erro ao enviar mensagens em lote para o Barramento de Serviço do Azure. Topic {0}. Mensagem {1}

# MESSAGE_SERVICEBUS_NOTFIT
source: Error to send message to buffer (Azure Service Bus). Unique Message too large (more than 256KB)
es_es: Error al enviar mensaje al buffer (Azure Service Bus). Mensaje individual muy grande (mayor a 256KB)

# RESOURCE_NOT_EXISTS
source: The resource for the employeeId {0} and periodId {1} does not exists
es_es: El recurso para el employeeId {0} y periodId {1} no existe
pt_pt: O recurso para o employeeId {0} e periodId {1} não existe

# SOC_SEND_COMMUNICATION_FAIL
source: Operation: Send communication request to SOC has fail
es_es: Operación: Envío communicación solicitada al SOC ha fallado
pt_pt: Falha na operação:Enviar comunicação para o SOC

# TIME_ENTRY_NOT_EXISTS
source: The time entry with id {0} does not exists
es_es: El time entry con id {0} no existe
pt_pt: A entrada de hora com id {0} não existe

# USER_ASSOCIATE_WITH_OTHER_RESOURCE
source: The user with email {0} is already associated with other resource {1}
es_es: El usuario con el mail {0} ya está asociado con otro recurso{1}
pt_pt: O usuário com e-mail {0} já está associado a outro recurso {1}

# USER_NOT_EXISTS
source: The user for the resource with mail {0} does not exists
es_es: El usuario (del recurso) con el mail {0} no existe
pt_pt: O usuário para o recurso com e-mail {0} não existe
